study12/tools/loadtest/results/study11_baseline__hot-post-view-comments100__capacity__20260730-151129__k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hot-post-view.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * hot_post_view: Up to 1000.00 iterations/s for 1m20s over 4 stages (maxVUs: 100-1000, gracefulStop: 10s)


running (0m01.0s), 0000/0100 VUs, 196 complete and 0 interrupted iterations
hot_post_view   [   1% ] 0000/0100 VUs  0m01.0s/1m20s  0200.00 iters/s

running (0m02.0s), 0000/0100 VUs, 396 complete and 0 interrupted iterations
hot_post_view   [   2% ] 0000/0100 VUs  0m02.0s/1m20s  0200.00 iters/s

running (0m03.0s), 0000/0100 VUs, 596 complete and 0 interrupted iterations
hot_post_view   [   4% ] 0000/0100 VUs  0m03.0s/1m20s  0200.00 iters/s

running (0m04.0s), 0000/0100 VUs, 796 complete and 0 interrupted iterations
hot_post_view   [   5% ] 0000/0100 VUs  0m04.0s/1m20s  0200.00 iters/s

running (0m05.0s), 0000/0100 VUs, 996 complete and 0 interrupted iterations
hot_post_view   [   6% ] 0000/0100 VUs  0m05.0s/1m20s  0200.00 iters/s

running (0m06.0s), 0001/0100 VUs, 1195 complete and 0 interrupted iterations
hot_post_view   [   7% ] 0001/0100 VUs  0m06.0s/1m20s  0200.00 iters/s

running (0m07.0s), 0000/0100 VUs, 1396 complete and 0 interrupted iterations
hot_post_view   [   9% ] 0000/0100 VUs  0m07.0s/1m20s  0200.00 iters/s

running (0m08.0s), 0001/0100 VUs, 1595 complete and 0 interrupted iterations
hot_post_view   [  10% ] 0001/0100 VUs  0m08.0s/1m20s  0200.00 iters/s

running (0m09.0s), 0000/0100 VUs, 1796 complete and 0 interrupted iterations
hot_post_view   [  11% ] 0000/0100 VUs  0m09.0s/1m20s  0200.00 iters/s

running (0m10.0s), 0000/0100 VUs, 1996 complete and 0 interrupted iterations
hot_post_view   [  12% ] 0000/0100 VUs  0m10.0s/1m20s  0200.00 iters/s

running (0m11.0s), 0001/0100 VUs, 2195 complete and 0 interrupted iterations
hot_post_view   [  14% ] 0001/0100 VUs  0m11.0s/1m20s  0200.00 iters/s

running (0m12.0s), 0001/0100 VUs, 2395 complete and 0 interrupted iterations
hot_post_view   [  15% ] 0001/0100 VUs  0m12.0s/1m20s  0200.00 iters/s

running (0m13.0s), 0001/0100 VUs, 2595 complete and 0 interrupted iterations
hot_post_view   [  16% ] 0001/0100 VUs  0m13.0s/1m20s  0200.00 iters/s

running (0m14.0s), 0000/0100 VUs, 2796 complete and 0 interrupted iterations
hot_post_view   [  17% ] 0000/0100 VUs  0m14.0s/1m20s  0200.00 iters/s

running (0m15.0s), 0000/0100 VUs, 2996 complete and 0 interrupted iterations
hot_post_view   [  19% ] 0000/0100 VUs  0m15.0s/1m20s  0200.00 iters/s

running (0m16.0s), 0001/0100 VUs, 3201 complete and 0 interrupted iterations
hot_post_view   [  20% ] 0001/0100 VUs  0m16.0s/1m20s  0211.80 iters/s

running (0m17.0s), 0001/0100 VUs, 3419 complete and 0 interrupted iterations
hot_post_view   [  21% ] 0001/0100 VUs  0m17.0s/1m20s  0223.81 iters/s

running (0m18.0s), 0000/0100 VUs, 3649 complete and 0 interrupted iterations
hot_post_view   [  22% ] 0000/0100 VUs  0m18.0s/1m20s  0235.77 iters/s

running (0m19.0s), 0001/0100 VUs, 3890 complete and 0 interrupted iterations
hot_post_view   [  24% ] 0001/0100 VUs  0m19.0s/1m20s  0247.78 iters/s

running (0m20.0s), 0001/0100 VUs, 4144 complete and 0 interrupted iterations
hot_post_view   [  25% ] 0001/0100 VUs  0m20.0s/1m20s  0259.79 iters/s

running (0m21.0s), 0001/0100 VUs, 4410 complete and 0 interrupted iterations
hot_post_view   [  26% ] 0001/0100 VUs  0m21.0s/1m20s  0271.80 iters/s

running (0m22.0s), 0000/0100 VUs, 4688 complete and 0 interrupted iterations
hot_post_view   [  27% ] 0000/0100 VUs  0m22.0s/1m20s  0283.77 iters/s

running (0m23.0s), 0000/0100 VUs, 4978 complete and 0 interrupted iterations
hot_post_view   [  29% ] 0000/0100 VUs  0m23.0s/1m20s  0295.78 iters/s

running (0m24.0s), 0000/0100 VUs, 5280 complete and 0 interrupted iterations
hot_post_view   [  30% ] 0000/0100 VUs  0m24.0s/1m20s  0307.79 iters/s

running (0m25.0s), 0000/0100 VUs, 5593 complete and 0 interrupted iterations
hot_post_view   [  31% ] 0000/0100 VUs  0m25.0s/1m20s  0319.79 iters/s

running (0m26.0s), 0001/0100 VUs, 5919 complete and 0 interrupted iterations
hot_post_view   [  32% ] 0001/0100 VUs  0m26.0s/1m20s  0331.80 iters/s

running (0m27.0s), 0000/0100 VUs, 6257 complete and 0 interrupted iterations
hot_post_view   [  34% ] 0000/0100 VUs  0m27.0s/1m20s  0343.77 iters/s

running (0m28.0s), 0000/0100 VUs, 6607 complete and 0 interrupted iterations
hot_post_view   [  35% ] 0000/0100 VUs  0m28.0s/1m20s  0355.78 iters/s

running (0m29.0s), 0002/0100 VUs, 6967 complete and 0 interrupted iterations
hot_post_view   [  36% ] 0002/0100 VUs  0m29.0s/1m20s  0367.79 iters/s

running (0m30.0s), 0001/0100 VUs, 7342 complete and 0 interrupted iterations
hot_post_view   [  37% ] 0001/0100 VUs  0m30.0s/1m20s  0379.79 iters/s

running (0m31.0s), 0000/0100 VUs, 7728 complete and 0 interrupted iterations
hot_post_view   [  39% ] 0000/0100 VUs  0m31.0s/1m20s  0391.77 iters/s

running (0m32.0s), 0000/0100 VUs, 8126 complete and 0 interrupted iterations
hot_post_view   [  40% ] 0000/0100 VUs  0m32.0s/1m20s  0403.78 iters/s

running (0m33.0s), 0000/0100 VUs, 8536 complete and 0 interrupted iterations
hot_post_view   [  41% ] 0000/0100 VUs  0m33.0s/1m20s  0415.78 iters/s

running (0m34.0s), 0001/0100 VUs, 8957 complete and 0 interrupted iterations
hot_post_view   [  42% ] 0001/0100 VUs  0m34.0s/1m20s  0427.79 iters/s

running (0m35.0s), 0000/0100 VUs, 9391 complete and 0 interrupted iterations
hot_post_view   [  44% ] 0001/0100 VUs  0m35.0s/1m20s  0439.80 iters/s

running (0m36.0s), 0001/0100 VUs, 9836 complete and 0 interrupted iterations
hot_post_view   [  45% ] 0001/0100 VUs  0m36.0s/1m20s  0451.77 iters/s

running (0m37.0s), 0000/0100 VUs, 10295 complete and 0 interrupted iterations
hot_post_view   [  46% ] 0000/0100 VUs  0m37.0s/1m20s  0463.78 iters/s

running (0m38.0s), 0000/0100 VUs, 10765 complete and 0 interrupted iterations
hot_post_view   [  47% ] 0000/0100 VUs  0m38.0s/1m20s  0475.79 iters/s

running (0m39.0s), 0001/0100 VUs, 11246 complete and 0 interrupted iterations
hot_post_view   [  49% ] 0001/0100 VUs  0m39.0s/1m20s  0487.79 iters/s

running (0m40.0s), 0001/0100 VUs, 11740 complete and 0 interrupted iterations
hot_post_view   [  50% ] 0001/0100 VUs  0m40.0s/1m20s  0499.80 iters/s

running (0m41.0s), 0000/0100 VUs, 12248 complete and 0 interrupted iterations
hot_post_view   [  51% ] 0000/0100 VUs  0m41.0s/1m20s  0516.35 iters/s

running (0m42.0s), 0001/0100 VUs, 12772 complete and 0 interrupted iterations
hot_post_view   [  52% ] 0001/0100 VUs  0m42.0s/1m20s  0533.03 iters/s

running (0m43.0s), 0000/0100 VUs, 13314 complete and 0 interrupted iterations
hot_post_view   [  54% ] 0000/0100 VUs  0m43.0s/1m20s  0549.68 iters/s

running (0m44.0s), 0001/0100 VUs, 13872 complete and 0 interrupted iterations
hot_post_view   [  55% ] 0001/0100 VUs  0m44.0s/1m20s  0566.38 iters/s

running (0m45.0s), 0001/0100 VUs, 14447 complete and 0 interrupted iterations
hot_post_view   [  56% ] 0001/0100 VUs  0m45.0s/1m20s  0583.05 iters/s

running (0m46.0s), 0001/0100 VUs, 15038 complete and 0 interrupted iterations
hot_post_view   [  57% ] 0001/0100 VUs  0m46.0s/1m20s  0599.71 iters/s

running (0m47.0s), 0001/0100 VUs, 15646 complete and 0 interrupted iterations
hot_post_view   [  59% ] 0001/0100 VUs  0m47.0s/1m20s  0616.37 iters/s

running (0m48.0s), 0001/0100 VUs, 16271 complete and 0 interrupted iterations
hot_post_view   [  60% ] 0001/0100 VUs  0m48.0s/1m20s  0633.05 iters/s

running (0m49.0s), 0001/0100 VUs, 16912 complete and 0 interrupted iterations
hot_post_view   [  61% ] 0001/0100 VUs  0m49.0s/1m20s  0649.71 iters/s

running (0m50.0s), 0000/0100 VUs, 17570 complete and 0 interrupted iterations
hot_post_view   [  62% ] 0000/0100 VUs  0m50.0s/1m20s  0666.35 iters/s

running (0m51.0s), 0001/0100 VUs, 18245 complete and 0 interrupted iterations
hot_post_view   [  64% ] 0001/0100 VUs  0m51.0s/1m20s  0683.04 iters/s

running (0m52.0s), 0001/0100 VUs, 18936 complete and 0 interrupted iterations
hot_post_view   [  65% ] 0001/0100 VUs  0m52.0s/1m20s  0699.70 iters/s

running (0m53.0s), 0001/0100 VUs, 19644 complete and 0 interrupted iterations
hot_post_view   [  66% ] 0001/0100 VUs  0m53.0s/1m20s  0716.37 iters/s

running (0m54.0s), 0000/0100 VUs, 20369 complete and 0 interrupted iterations
hot_post_view   [  67% ] 0000/0100 VUs  0m54.0s/1m20s  0733.02 iters/s

running (0m55.0s), 0000/0100 VUs, 21110 complete and 0 interrupted iterations
hot_post_view   [  69% ] 0000/0100 VUs  0m55.0s/1m20s  0749.68 iters/s

running (0m56.0s), 0000/0100 VUs, 21869 complete and 0 interrupted iterations
hot_post_view   [  70% ] 0000/0100 VUs  0m56.0s/1m20s  0766.37 iters/s

running (0m57.0s), 0001/0100 VUs, 22642 complete and 0 interrupted iterations
hot_post_view   [  71% ] 0001/0100 VUs  0m57.0s/1m20s  0783.02 iters/s

running (0m58.0s), 0001/0100 VUs, 23434 complete and 0 interrupted iterations
hot_post_view   [  72% ] 0001/0100 VUs  0m58.0s/1m20s  0799.70 iters/s

running (0m59.0s), 0001/0100 VUs, 24243 complete and 0 interrupted iterations
hot_post_view   [  74% ] 0001/0100 VUs  0m59.0s/1m20s  0816.38 iters/s

running (1m00.0s), 0001/0100 VUs, 25067 complete and 0 interrupted iterations
hot_post_view   [  75% ] 0001/0100 VUs  1m00.0s/1m20s  0833.04 iters/s

running (1m01.0s), 0001/0100 VUs, 25908 complete and 0 interrupted iterations
hot_post_view   [  76% ] 0001/0100 VUs  1m01.0s/1m20s  0849.70 iters/s

running (1m02.0s), 0000/0100 VUs, 26767 complete and 0 interrupted iterations
hot_post_view   [  77% ] 0000/0100 VUs  1m02.0s/1m20s  0866.36 iters/s

running (1m03.0s), 0002/0100 VUs, 27640 complete and 0 interrupted iterations
hot_post_view   [  79% ] 0002/0100 VUs  1m03.0s/1m20s  0883.03 iters/s

running (1m04.0s), 0000/0100 VUs, 28532 complete and 0 interrupted iterations
hot_post_view   [  80% ] 0000/0100 VUs  1m04.0s/1m20s  0899.68 iters/s

running (1m05.0s), 0001/0100 VUs, 29440 complete and 0 interrupted iterations
hot_post_view   [  81% ] 0001/0100 VUs  1m05.0s/1m20s  0916.36 iters/s

running (1m06.0s), 0002/0100 VUs, 30364 complete and 0 interrupted iterations
hot_post_view   [  82% ] 0002/0100 VUs  1m06.0s/1m20s  0933.03 iters/s

running (1m07.0s), 0000/0100 VUs, 31307 complete and 0 interrupted iterations
hot_post_view   [  84% ] 0000/0100 VUs  1m07.0s/1m20s  0949.69 iters/s

running (1m08.0s), 0001/0100 VUs, 32264 complete and 0 interrupted iterations
hot_post_view   [  85% ] 0001/0100 VUs  1m08.0s/1m20s  0966.36 iters/s

running (1m09.0s), 0000/0100 VUs, 33239 complete and 0 interrupted iterations
hot_post_view   [  86% ] 0000/0100 VUs  1m09.0s/1m20s  0983.01 iters/s

running (1m10.0s), 0000/0100 VUs, 34231 complete and 0 interrupted iterations
hot_post_view   [  87% ] 0000/0100 VUs  1m10.0s/1m20s  0999.71 iters/s

running (1m11.0s), 0000/0100 VUs, 35183 complete and 0 interrupted iterations
hot_post_view   [  89% ] 0000/0100 VUs  1m11.0s/1m20s  0901.83 iters/s

running (1m12.0s), 0001/0100 VUs, 36034 complete and 0 interrupted iterations
hot_post_view   [  90% ] 0001/0100 VUs  1m12.0s/1m20s  0801.81 iters/s

running (1m13.0s), 0001/0100 VUs, 36786 complete and 0 interrupted iterations
hot_post_view   [  91% ] 0001/0100 VUs  1m13.0s/1m20s  0701.78 iters/s

running (1m14.0s), 0000/0100 VUs, 37438 complete and 0 interrupted iterations
hot_post_view   [  92% ] 0000/0100 VUs  1m14.0s/1m20s  0601.91 iters/s

running (1m15.0s), 0001/0100 VUs, 37990 complete and 0 interrupted iterations
hot_post_view   [  94% ] 0001/0100 VUs  1m15.0s/1m20s  0501.70 iters/s

running (1m16.0s), 0000/0100 VUs, 38442 complete and 0 interrupted iterations
hot_post_view   [  95% ] 0000/0100 VUs  1m16.0s/1m20s  0401.87 iters/s

running (1m17.0s), 0000/0100 VUs, 38794 complete and 0 interrupted iterations
hot_post_view   [  96% ] 0000/0100 VUs  1m17.0s/1m20s  0301.83 iters/s

running (1m18.0s), 0000/0100 VUs, 39046 complete and 0 interrupted iterations
hot_post_view   [  97% ] 0000/0100 VUs  1m18.0s/1m20s  0201.74 iters/s

running (1m19.0s), 0001/0100 VUs, 39197 complete and 0 interrupted iterations
hot_post_view   [  99% ] 0001/0100 VUs  1m19.0s/1m20s  0101.49 iters/s

running (1m20.0s), 0000/0100 VUs, 39249 complete and 0 interrupted iterations
hot_post_view   [ 100% ] 0000/0100 VUs  1m20.0s/1m20s  0007.07 iters/s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.99' rate=0.00%

    http_req_failed
    ✗ 'rate<0.01' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 39249   490.601108/s
    checks_succeeded...: 0.00%   0 out of 39249
    checks_failed......: 100.00% 39249 out of 39249

    ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 39249

    HTTP
    http_req_duration....: avg=451.75µs min=108.33µs med=261.58µs p(90)=741.41µs p(95)=1.27ms p(99)=2.8ms  max=63.71ms
    http_req_failed......: 100.00% 39249 out of 39249
    http_reqs............: 39249   490.601108/s

    EXECUTION
    iteration_duration...: avg=534.97µs min=136.33µs med=317.75µs p(90)=899.11µs p(95)=1.54ms p(99)=3.19ms max=63.81ms
    iterations...........: 39249   490.601108/s
    vus..................: 0       min=0              max=2  
    vus_max..............: 100     min=100            max=100

    NETWORK
    data_received........: 16 MB   199 kB/s
    data_sent............: 11 MB   131 kB/s



running (1m20.0s), 0000/0100 VUs, 39249 complete and 0 interrupted iterations
hot_post_view ✓ [ 100% ] 0000/0100 VUs  1m20s  0007.07 iters/s